import images from '@images';

export const ARROW_LINK = {
  img: {
    alt: 'Иконка стрелочки',
  },
};

/* -------------------------------------------------------------------------- */

export const LOGIN_BUTTONS = {
  login: 'Войти',
  register: 'Регистрация',
};
/* -------------------------------------------------------------------------- */

export const LOGO = {
  img: {
    alt: 'Логотип страницы',
  },
};
/* -------------------------------------------------------------------------- */

export const MOVIES_CARD = {
  img: {
    alt: 'Постер к фильму',
  },
  saveButton: {
    text: 'Сохранить',
  },
};
/* -------------------------------------------------------------------------- */

export const NOTHING_FOUND_STUB = {
  description: 'Ничего не удалось найти :/',
  img: {
    alt: 'Картинка котика',
    src: images.NOT_FOUND_CAT,
  },
};
/* -------------------------------------------------------------------------- */

export const SEARCH_FORM = {
  checkBox: {
    label: 'Короткометражки',
  },
  field: {
    img: {
      alt: 'Иконка увеличительного стекла',
    },
    placeholder: 'Фильм',
  },
  startButton: {
    label: 'Найти',
  },
};
/* -------------------------------------------------------------------------- */
